/*================================================================================*/
/*                    C++_Development_Basics: The_Yellow_Belt                     */
/*================================================================================*/
/*  Title: Реализовать функции, объявленные в заголовочном файле                  */
/*  Start_time: 22.07.2022 15:45                                                  */
/*  End_time:                                                                     */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * Вам дан заголовочный файл sum_reverse_sort.h, содержащий объявления трёх функций:
 *
 * https://github.com/nikkutuzov/CPP_education/blob/master/courseraYandexMIPT/Templates/2_YB_W3_N001_SumReverseSort/sum_reverse_sort.h
 *
 * Вам надо прислать cpp-файл, содержащий определения этих функций.
 *
 * Функции должны складывать два числа, обращать строку и сортировать вектор чисел
 * по возрастанию соотвественно.
 *
 */

/*<=====================================CODE=====================================>*/

#include <iostream>

#include "sum_reverse_sort.h"

/*<-------------------------------------main------------------------------------->*/

int main() {

  return 0;
}

/*<-----------------------definition_of_funcs_and_classes------------------------>*/

int Sum(int x, int y) {

}

std::string Reverse(std::string s) {

}

void Sort(std::vector<int>& nums) {

}
