/*================================================================================*/
/*                    C++_Development_Basics: The_Yellow_Belt                     */
/*================================================================================*/
/*  Title: Реализовать функции, объявленные в заголовочном файле                  */
/*  Start_time: 22.07.2022 15:45                                                  */
/*  End_time: 22.07.2022 16:15                                                    */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * Вам дан заголовочный файл sum_reverse_sort.h, содержащий объявления трёх функций:
 *
 * https://github.com/nikkutuzov/CPP_education/blob/master/courseraYandexMIPT/Templates/2_YB_W3_N001_SumReverseSort/sum_reverse_sort.h
 *
 * Вам надо прислать cpp-файл, содержащий определения этих функций.
 *
 * Функции должны складывать два числа, обращать строку и сортировать вектор чисел
 * по возрастанию соотвественно.
 *
 */

/*<=====================================CODE=====================================>*/

#include <algorithm>

#include "sum_reverse_sort.h"

/*<-------------------------------------main------------------------------------->*/
// ПРИ ОТПРАВКЕ НА ПРОВЕРКУ НУЖНО УДАЛИТЬ ФУНКЦИЮ main()
// я оставил ее тольк для работы проверке при сборке!
int main() {

  return 0;
}

/*<-----------------------definition_of_funcs_and_classes------------------------>*/

int Sum(int x, int y) {
  return x + y;
}

std::string Reverse(std::string s) {
  std::reverse(begin(s), end(s));

  return s;
}

void Sort(std::vector<int>& nums) {
  std::sort(begin(nums), end(nums));
}
