/*================================================================================*/
/*                    C++_Development_Basics: The_White_Belt                      */
/*================================================================================*/
/*  Tittle: Greatest common divisor                                               */
/*  Start_time: 23.06.2022 16:42                                                  */
/*  End_time: 23.06.2022 17:01                                                    */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * В stdin даны два натуральных числа.
 * Выведите в stdout их наибольший общий делитель.
 *
 * Подсказка
 *
 * Если вам не удаётся сдать задачу, вы можете воспользоваться подсказкой.
 * Но сначала попробуйте решить её сами :)
 * https://github.com/nikkutuzov/CPP_education/blob/master/courseraYandexMIPT/Attachments/W1_N008_GCD.pdf
 *
 */

/*<=====================================CODE=====================================>*/

#include <iostream>

/*<-------------------------------------main------------------------------------->*/

int main() {
  int a, b;
  std::cin >> a >> b;

  while (a > 0 and b > 0) {
    if (a > b) {
      a = a % b;
    } else {
      b = b % a;
    }
  }

  std::cout << a + b << std::endl;

  return 0;
}
