/*================================================================================*/
/*                    C++_Development_Basics: The_White_Belt                      */
/*================================================================================*/
/*  Tittle: Decimal to binary                                                     */
/*  Start_time: 23.06.2022 17:04                                                  */
/*  End_time: 23.06.2022 17:15                                                    */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * На вход дано целое положительное число N. Выведите его в двоичной системе
 * счисления без ведущих нулей.
 *
 * Подсказки
 *
 * - число N можно считывать в переменную типа int
 * - алгоритм перевода из десятичной системы счисления в двоичную
 *   https://github.com/nikkutuzov/CPP_education/blob/master/courseraYandexMIPT/Attachments/W1_N009_Algorithm.pdf
 * - в этой задаче вам может пригодиться контейнер vector; напоминаем, что
 *   добавление значения x в конец вектора v делается так: v.push_back(x);
 *
 */

/*<=====================================CODE=====================================>*/

#include <iostream>
#include <vector>

/*<-------------------------------------main------------------------------------->*/

int main() {
  int number;
  std::vector<int> bin;
  std::cin >> number;

  while(number > 0) {
    bin.push_back(number % 2);
    number /= 2;
  }

  for (int i = bin.size() - 1; i >= 0; --i) {
    std::cout << bin[i];
  }

  std::cout << std::endl;

  return 0;
}
