/*================================================================================*/
/*                    C++_Development_Basics: The_White_Belt                      */
/*================================================================================*/
/*  Tittle: Price discount                                                        */
/*  Start_time: 23.06.2022 13:24                                                  */
/*  End_time: 23.06.2022 13:36                                                    */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * Написать программу вычисления стоимости покупки товара с учётом скидки. Если
 * исходная стоимость товара больше A рублей, то на неё устанавливается скидка
 * в X процентов. Если исходная стоимость товара больше B рублей, то на неё
 * устанавливается скидка в Y процентов.
 *
 * На вход программе даны пять вещественных чисел: N, A, B, X, Y (A < B) - где
 * N - исходная стоимость товара. Выведите стоимость покупки товара с учётом скидки.
 *
 */

/*<=====================================CODE=====================================>*/

#include <iostream>

/*<-------------------------------------main------------------------------------->*/

int main() {
  double n, a, b, x, y;
  std::cin >> n >> a >> b >> x >> y;
  // сначала сравниваем с b, так как по условию b > a
  if (n > b) {
    n *= (1 - y / 100);
  } else if (n > a) {
    n *= (1 - x / 100);
  }

  std::cout << n << std::endl;

  return 0;
}
