/*================================================================================*/
/*                    C++_Development_Basics: The_White_Belt                      */
/*================================================================================*/
/*  Tittle: The second entry                                                      */
/*  Start_time: 23.06.2022 16:16                                                  */
/*  End_time: 23.06.2022 16:36                                                    */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * Дана строка. Найдите в этой строке второе вхождение буквы f и выведите индекс
 * этого вхождения. Если буква f в данной строке встречается только один раз,
 * выведите число -1, а если не встречается ни разу, выведите число -2.
 * Индексы нумеруются с нуля.
 *
 */

/*<=====================================CODE=====================================>*/

#include <iostream>
#include <string>

/*<-------------------------------------main------------------------------------->*/

int main() {
  std::string str;
  int result = -2; // если не будет вхождений f, то -2 будет ответом
  std::cin >> str;

  for (int i = 0; i < str.size(); ++i) {
    if (str[i] == 'f') { // если встречаем f
      if(result == -2) {
        result = -1; // ... в первый раз, устанавливаем -1
      } else if (result == -1) { // если первое вхождение уже было
        result = i; // ставим индекс второго вхождения в качестве ответа
        break; // как только получили второе вхождение, НУЖНО заканчивать
      }
    }
  }

  std::cout << result << std::endl; // распечатываем ответ

  return 0;
}
