/*================================================================================*/
/*                    C++_Development_Basics: The_White_Belt                      */
/*================================================================================*/
/*  Tittle: Minimum string                                                        */
/*  Start_time: 23.06.2022 10:53                                                  */
/*  End_time: 23.06.2022 11:11                                                    */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * В стандартном потоке даны три строки, разделённые пробелом. Каждая строка состоит
 * из строчных латинских букв и имеет длину не более 30 символов. Выведите в
 * стандартный вывод лексикографически минимальную из них.
 *
 */

/*<=====================================CODE=====================================>*/

#include <iostream>
#include <string>

/*<-------------------------------------main------------------------------------->*/

int main() {
  std::string strA, strB, strC;
  std::cin >> strA >> strB >> strC;
  if (strA <= strB and strA <= strC) {
    std::cout << strA;
  } else if (strB <= strA and strB <= strC) {
    std::cout << strB;
  } else {
    std::cout << strC;
  }
  std::cout << std::endl;

  return 0;
}
