/*================================================================================*/
/*                    C++_Development_Basics: The_White_Belt                      */
/*================================================================================*/
/*  Tittle: Quadratic Equation                                                    */
/*  Start_time: 23.06.2022                                                        */
/*  End_time:                                                                     */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * На вход вашей программы в стандартном потоке ввода подаются действительные
 * коэффициенты A, B и C  уравнения Ax^2 + Bx + C = 0. Выведите все его различные
 * действительные корни в поток вывода в любом порядке, при этом разделяя корни
 * пробелами. Гарантируется, что хотя бы один из коэффициентов уравнения не равен
 * нулю.
 *
 * Подсказки
 *
 * 1. Для вычисления квадратного корня используйте функцию sqrt из библиотеки cmath.
 * Чтобы подключить библиотеку, в начале программы напишите
 * #include <cmath>
 * 2. В случае возникновения вопросов по решению данного уравнения, общую схему
 * решения с разъяснениями можно посмотреть в приложенном файле
 * https://github.com/nikkutuzov/CPP_education/blob/master/courseraYandexMIPT/Attachments/W1_N003_Algorithm.pdf
 *
 */

/*<=====================================CODE=====================================>*/

#include <iostream>

/*<-------------------------------------main------------------------------------->*/

int main() {

  return 0;
}
