/*================================================================================*/
/*                    C++_Development_Basics: The_White_Belt                      */
/*================================================================================*/
/*  Tittle: Integer division                                                      */
/*  Start_time: 23.06.2022 13:18                                                  */
/*  End_time: 23.06.2022 13:22                                                    */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * Дано два целых числа A и B в диапазоне от 0 до 1 000 000 включительно. Напишите
 * программу, которая вычисляет целую часть частного от деления A на B.
 *
 * Если B = 0, выведите "Impossible".
 *
 */

/*<=====================================CODE=====================================>*/

#include <iostream>

/*<-------------------------------------main------------------------------------->*/

int main() {
  int a, b;
  std::cin >> a >> b;
  if (b == 0) {
    std::cout << "Impossible";
  } else {
    std::cout << a / b;
  }
  std::cout << std::endl;

  return 0;
}
