/*================================================================================*/
/*                    C++_Development_Basics: The_White_Belt                      */
/*================================================================================*/
/*  Tittle: Even or Odd                                                           */
/*  Start_time: 23.06.2022 13:41                                                  */
/*  End_time: 23.06.2022 13:44                                                    */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * Дано два целых числа A и B (A <= B, A >= 1, B <= 30000).
 * Выведите через пробел все чётные числа от A до B (включительно).
 *
 * Для проверки целого числа x на чётность используется операция  взятия остатка от
 * деления на 2, которая в C++ оформляется с помощью  символа "%". Например,
 *
 * int x;
 * cin >> x;
 * if (x % 2 == 0) {
 *  // x - чётное число
 * } else {
 *  // x - нечётное число
 * }
 *
 */

/*<=====================================CODE=====================================>*/

#include <iostream>

/*<-------------------------------------main------------------------------------->*/

int main() {
  int a, b;
  std::cin >> a >> b;
  for (int i = a; i <= b; ++i) {
    if (i % 2 == 0) {
      std::cout << i << " ";
    }
  }

  std::cout << std::endl;

  return 0;
}
