/*================================================================================*/
/*                    C++_Development_Basics: The_White_Belt                      */
/*================================================================================*/
/*  Tittle: Unique strings count                                                  */
/*  Start_time: 26.06.2022 12:43                                                  */
/*  End_time: 26.06.2022 12:55                                                    */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * Дан набор строк. Найдите количество уникальных строк в этом наборе.
 *
 * Формат ввода
 *
 * Сначала вводится количество строк N, затем - сами N строк, разделённые символом
 * перевода строки. Все строки состоят лишь из латинских букв, цифр и символов
 * подчёркивания.
 *
 * Формат вывода
 *
 * Выведите единственное целое число - количество уникальных строк в данном наборе.
 *
 * Пример
 *
 * Ввод
 *
 * 6
 * first
 * second
 * first
 * third
 * second
 * second
 *
 * Вывод
 *
 * 3
 *
 */

/*<=====================================CODE=====================================>*/

#include <iostream>
#include <string>
#include <set>

/*<-------------------------------------main------------------------------------->*/

int main() {
  std::set<std::string> strings;
  int count;
  std::cin >> count;
  for (int i = 0; i < count; ++i) {
    std::string str;
    std::cin >> str;
    strings.insert(str);
  }
  std::cout << strings.size() << std::endl;

  return 0;
}
