/*================================================================================*/
/*                    C++_Development_Basics: The_White_Belt                      */
/*================================================================================*/
/*  Tittle: Reversing of sequence ver. 2                                          */
/*  Start_time: 24.06.2022 13:24                                                  */
/*  End_time: 24.06.2022 13:32                                                    */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * Реализуйте функцию vector<int> Reversed(const vector<int>& v), возвращающую копию
 * вектора v, в которой числа переставлены в обратном порядке.
 *
 * Гарантируется, что вектор v имеет ненулевую длину.
 *
 * Пример
 *
 *   Вектор v            Результат функции
 * 1, 5, 3, 4, 2           2, 4, 3, 5, 1
 *
 */

/*<=====================================CODE=====================================>*/

#include <iostream>
#include <vector>

std::vector<int> Reversed(const std::vector<int>& v) {
  std::vector<int> result;

  for (int i = v.size() - 1; i >= 0; --i) {
    result.push_back(v[i]);
  }

  return result;
}

/*<-------------------------------------main------------------------------------->*/

int main() {

  return 0;
}
