/*================================================================================*/
/*                    C++_Development_Basics: The_White_Belt                      */
/*================================================================================*/
/*  Tittle: Middle temperature                                                    */
/*  Start_time: 24.06.2022 13:34                                                  */
/*  End_time: 24.06.2022 13:58                                                    */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * Даны значения температуры, наблюдавшиеся в течение N подряд идущих дней. Найдите
 * номера дней (в нумерации с нуля) со значением температуры выше среднего
 * арифметического за все N дней.
 *
 * Гарантируется, что среднее арифметическое значений температуры является целым
 * числом.
 *
 * Формат ввода
 *
 * Вводится число N, затем N неотрицательных целых чисел — значения температуры в
 * 0-й, 1-й, ... (N−1)-й день.
 *
 * Формат вывода
 *
 * Первое число K — количество дней, значение температуры в которых выше среднего
 * арифметического. Затем K целых чисел — номера этих дней.
 *
 * Пример
 *
 * Ввод
 *
 * 5
 * 7 6 3 0 9
 *
 * Вывод
 *
 * 3
 * 0 1 4
 *
 */

/*<=====================================CODE=====================================>*/

#include <iostream>
#include <vector>

/*<-------------------------------------main------------------------------------->*/

int main() {
  int N = 0;
  std::cin >> N;
  std::vector<int> temperatures(N);

  int average_temp = 0;
  for (int& item : temperatures) {
    std::cin >> item;
    average_temp +=item;
  }
  average_temp /= N;

  std::vector<int> result;

  for (int i = 0; i < N; ++i) {
    if (temperatures[i] > average_temp) {
      result.push_back(i);
    }
  }

  std::cout << result.size() << std::endl;
  for (const int& item : result) {
    std::cout << item << " ";
  }
  std::cout << std::endl;

  return 0;
}
