/*================================================================================*/
/*                    C++_Development_Basics: The_White_Belt                      */
/*================================================================================*/
/*  Tittle: Update if greater (maximizer)                                         */
/*  Start_time: 24.06.2022 12:36                                                  */
/*  End_time: 24.06.2022 12:49                                                    */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * Напишите функцию UpdateIfGreater, которая принимает два целочисленных аргумента:
 * first и second. Если first оказался больше second, Ваша функция должна записывать
 * в second значение параметра first. При этом указанная функция не должна ничего
 * возвращать, а изменение параметра second должно быть видно на вызывающей стороне.
 *
 * Пример
 *
 * int a = 4;
 * int b = 2;
 * UpdateIfGreater(a, b);
 * // b должно стать равно 4
 *
 * Замечание
 *
 * В данной задаче вам нужно самостоятельно выбрать типы для параметров функции
 * UpdateIfGreater. Подумайте, какой из них обязан быть ссылкой, а какой может быть
 * просто int. При этом учтите разные варианты вызова функции:
 *
 * UpdateIfGreater(x, y);
 * UpdateIfGreater(5, y);
 *
 */

/*<=====================================CODE=====================================>*/

#include <iostream>

void UpdateIfGreater(int first, int& second) {
  if (first > second) {
    second = first;
  }
}

/*<-------------------------------------main------------------------------------->*/

int main() {

  return 0;
}
