/*================================================================================*/
/*                    C++_Development_Basics: The_White_Belt                      */
/*================================================================================*/
/*  Tittle: Factorial - the recursive solution                                    */
/*  Start_time: 23.06.2022 17:45                                                  */
/*  End_time: 23.06.2022 17:49                                                    */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * Напишите функцию, которая:
 * - называется Factorial
 * - возвращает int
 * - принимает int и возвращает факториал своего аргумента. Гарантируется, что
 *   аргумент функции по модулю не превышает 10. Для отрицательных аргументов
 *   функция должна возвращать 1.
 */

/*<=====================================CODE=====================================>*/

#include <iostream>

int Factorial(int n) {
  if (n <= 1) {
    return 1;
  } else {
    return n * Factorial(n - 1);
  }
}

/*<-------------------------------------main------------------------------------->*/

int main() {
  int n;
  std::cin >> n;

  std::cout << Factorial(n) << std::endl;

  return 0;
}
