/*================================================================================*/
/*                    C++_Development_Basics: The_White_Belt                      */
/*================================================================================*/
/*  Tittle: Factorial - the ordinary solution                                     */
/*  Start_time: 23.06.2022 17:32                                                  */
/*  End_time: 23.06.2022 17:44                                                    */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * Напишите функцию, которая:
 * - называется Factorial
 * - возвращает int
 * - принимает int и возвращает факториал своего аргумента. Гарантируется, что
 *   аргумент функции по модулю не превышает 10. Для отрицательных аргументов
 *   функция должна возвращать 1.
 *
 */

/*<=====================================CODE=====================================>*/

#include <iostream>

int Factorial(int n) {
  int f = 1;
  for (int i = 2; i <= n; ++i) {
    f = f * i;
  }
  return f;
}

/*<-------------------------------------main------------------------------------->*/

int main() {
  int n;
  std::cin >> n;

  std::cout << Factorial(n) << std::endl;

  return 0;
}
