/*================================================================================*/
/*                    C++_Development_Basics: The_White_Belt                      */
/*================================================================================*/
/*  Tittle: Reversing of sequence                                                 */
/*  Start_time: 24.06.2022 13:09                                                  */
/*  End_time: 24.06.2022 13:19                                                    */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * Реализуйте функцию void Reverse(vector<int>& v), которая переставляет элементы
 * вектора в обратном порядке.
 *
 * Гарантируется, что вектор v имеет ненулевую длину.
 *
 * Пример
 *
 * vector<int> numbers = {1, 5, 3, 4, 2};
 * Reverse(numbers);
 * // numbers должен оказаться равен {2, 4, 3, 5, 1}
 *
 */

/*<=====================================CODE=====================================>*/

#include <iostream>
#include <vector>

void Reverse(std::vector<int>& v) {
  int size = v.size();
  for (int i = 0; i < size / 2; ++i) {
    int tmp = v[i];
    v[i] = v[size - 1 - i];
    v[size - 1 - i] = tmp;
  }
}

/*<-------------------------------------main------------------------------------->*/

int main() {

  return 0;
}
