/*================================================================================*/
/*                    C++_Development_Basics: The_White_Belt                      */
/*================================================================================*/
/*  Tittle: Palindrome                                                            */
/*  Start_time: 24.06.2022 10:54                                                  */
/*  End_time: 24.06.2022 11:03                                                    */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * Напишите функцию, которая
 *
 * - называется IsPalindrome
 * - возвращает bool
 * - принимает параметр типа string и возвращает, является ли переданная строка
 *   палиндромом
 *
 * Палиндром - это слово или фраза, которые одинаково читаются слева направо и
 * справа налево. Пустая строка является палиндромом.
 *
 */

/*<=====================================CODE=====================================>*/

#include <iostream>
#include <string>

bool IsPalindrome(std::string str) {
  for (int i = 0, j = str.size() - 1; i < str.size() / 2; ++i, --j) {
    if (str[i] != str[j]) {
      return false;
    }
  }

  return true;
}

/*<-------------------------------------main------------------------------------->*/

int main() {
  std::string str;
  std::cin >> str;

  std::cout << IsPalindrome(str) << std::endl;

  return 0;
}
