/*================================================================================*/
/*                    C++_Development_Basics: The_White_Belt                      */
/*================================================================================*/
/*  Tittle: initialization methods                                                */
/*  Start_time: 30.06.2022 15:11                                                  */
/*  End_time: 30.06.2022 15:13                                                    */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * Определите тип Incognizable, для которого следующий код будет корректен:
 *
 * int main() {
 *  Incognizable a;
 *  Incognizable b = {};
 *  Incognizable c = {0};
 *  Incognizable d = {0, 1};
 * return 0;
 * }
 *
 */

/*<=====================================CODE=====================================>*/

#include <iostream>

struct Incognizable {
  int x = 0;
  int y = 0;
};

/*<-------------------------------------main------------------------------------->*/

int main() {
  Incognizable a;
  Incognizable b = {};
  Incognizable c = {0};
  Incognizable d = {0, 1};

  return 0;
}
