/*================================================================================*/
/*                    C++_Development_Basics: The_White_Belt                      */
/*================================================================================*/
/*  Title: Output with precision                                                  */
/*  Start_time: 02.07.2022 13:47                                                  */
/*  End_time: 02.07.2022 14:00                                                    */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * В файле input.txt записаны вещественные числа, по одному на строчку. На
 * стандартный вывод напечатайте эти числа в том же порядке, по одному на строке,но
 * сделайте так, чтобы у каждого из них было ровно три знака после десятичной точки.
 *
 * Пример ввода 1
 *
 * 5
 * 0.34567
 * 10.4
 *
 * Пример вывода 1
 *
 * 5.000
 * 0.346
 * 10.400
 *
 * Пример ввода 2
 *
 * 3.33353
 * 3.333
 * 3.3
 *
 * Пример вывода 2
 *
 * 3.334
 * 3.333
 * 3.300
 *
 * Примечание:
 *
 * Воспользуйтесь стандартными манипуляторами потоков вывода.
 *
 */

/*<=====================================CODE=====================================>*/

#include <iostream>
#include <fstream>
#include <iomanip>

/*<-------------------------------------main------------------------------------->*/

int main() {
  std::ifstream input("W4_N005_input.txt"); // for coursera rename to input.txt

  if (input) {
    double n;
    std::cout << std::fixed << std::setprecision(3);

    while (input >> n) {
      std::cout << n << std::endl;
    }
  }

  return 0;
}
