/*================================================================================*/
/*                    C++_Development_Basics: The_White_Belt                      */
/*================================================================================*/
/*  Title: Working with files part 1                                              */
/*  Start_time: 02.07.2022 12:59                                                  */
/*  End_time: 02.07.2022 13:16                                                    */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * В этом задании вам предстоит написать две небольшие программы.
 * Каждый пункт - отдельная задача, решение отправляйте в поле с соответствующим
 * номером.
 *
 * Часть 1
 *
 * Ваша программа должна считать содержимое файла input.txt и напечатать его на
 * экран без изменений. Гарантируется, что содержимое файла input.txt заканчивается
 * переводом строки.
 *
 * Пример
 *
 * input.txt
 *
 * Keep calm
 * and
 * learn C++
 *
 * stdout
 *
 * Keep calm
 * and
 * learn C++
 *
 */

/*<=====================================CODE=====================================>*/

#include <iostream>
#include <string>
#include <fstream>

/*<-------------------------------------main------------------------------------->*/

int main() {
  std::ifstream input("W4_N004_input.txt"); // for coursera rename to input.txt
  if (input) {
    std::string str;
    while (std::getline(input, str)) {
      std::cout << str << std::endl;
    }
  }

  return 0;
}
