/*================================================================================*/
/*                    C++_Development_Basics: The_Yellow_Belt                     */
/*================================================================================*/
/*  Title: Tests for func GetDistinctRealRootCount                                */
/*  Start_time: 21.07.2022 20:31                                                  */
/*  End_time:                                                                     */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * Функция:
 *
 * int GetDistinctRealRootCount(double a, double b, double c);
 *
 * возвращает количество уникальных действительных корней уравнения ax² + bx + c = 0
 * Разработайте набор юнит-тестов для проверки корректности реализации этой функции.
 * Случай, когда все три коэффициента равны нулю, тестировать не надо.
 *
 * Начать работу вы можете с шаблона, который содержит наш фреймворк юнит-тест и
 * заготовку функции GetDistinctRealRootCount.
 *
 *
 *
 */

/*<=====================================CODE=====================================>*/

#include <iostream>

/*<-------------------------------------main------------------------------------->*/

int main() {

  return 0;
}
